droneshire/ti/ccsv7/ccs_base/common/targetdb/Modules/C2000/f2837xd_gpio_data_regs.xml
	<register id="GPDCLEAR" width="32" page="1" offset="0x1c" internal="0" description="GPIO D Data Clear Register (GPIO96 to 127)">
		<bitfield id="GPIO96" description="Output Clear bit for this pin" begin="0" end="0" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO97" description="Output Clear bit for this pin" begin="1" end="1" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO98" description="Output Clear bit for this pin" begin="2" end="2" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO99" description="Output Clear bit for this pin" begin="3" end="3" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO100" description="Output Clear bit for this pin" begin="4" end="4" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO101" description="Output Clear bit for this pin" begin="5" end="5" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO102" description="Output Clear bit for this pin" begin="6" end="6" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO103" description="Output Clear bit for this pin" begin="7" end="7" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO104" description="Output Clear bit for this pin" begin="8" end="8" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO105" description="Output Clear bit for this pin" begin="9" end="9" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO106" description="Output Clear bit for this pin" begin="10" end="10" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO107" description="Output Clear bit for this pin" begin="11" end="11" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO108" description="Output Clear bit for this pin" begin="12" end="12" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO109" description="Output Clear bit for this pin" begin="13" end="13" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO110" description="Output Clear bit for this pin" begin="14" end="14" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO111" description="Output Clear bit for this pin" begin="15" end="15" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO112" description="Output Clear bit for this pin" begin="16" end="16" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO113" description="Output Clear bit for this pin" begin="17" end="17" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO114" description="Output Clear bit for this pin" begin="18" end="18" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO115" description="Output Clear bit for this pin" begin="19" end="19" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO116" description="Output Clear bit for this pin" begin="20" end="20" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO117" description="Output Clear bit for this pin" begin="21" end="21" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO118" description="Output Clear bit for this pin" begin="22" end="22" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO119" description="Output Clear bit for this pin" begin="23" end="23" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO120" description="Output Clear bit for this pin" begin="24" end="24" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO121" description="Output Clear bit for this pin" begin="25" end="25" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO122" description="Output Clear bit for this pin" begin="26" end="26" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO123" description="Output Clear bit for this pin" begin="27" end="27" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO124" description="Output Clear bit for this pin" begin="28" end="28" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO125" description="Output Clear bit for this pin" begin="29" end="29" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO126" description="Output Clear bit for this pin" begin="30" end="30" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO127" description="Output Clear bit for this pin" begin="31" end="31" width="1" rwaccess="R/W"/>
	</register>
	<register id="GPDTOGGLE" width="32" page="1" offset="0x1e" internal="0" description="GPIO D Data Toggle Register (GPIO96 to 127) ">
		<bitfield id="GPIO96" description="Output Toggle bit for this pin" begin="0" end="0" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO97" description="Output Toggle bit for this pin" begin="1" end="1" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO98" description="Output Toggle bit for this pin" begin="2" end="2" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO99" description="Output Toggle bit for this pin" begin="3" end="3" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO100" description="Output Toggle bit for this pin" begin="4" end="4" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO101" description="Output Toggle bit for this pin" begin="5" end="5" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO102" description="Output Toggle bit for this pin" begin="6" end="6" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO103" description="Output Toggle bit for this pin" begin="7" end="7" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO104" description="Output Toggle bit for this pin" begin="8" end="8" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO105" description="Output Toggle bit for this pin" begin="9" end="9" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO106" description="Output Toggle bit for this pin" begin="10" end="10" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO107" description="Output Toggle bit for this pin" begin="11" end="11" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO108" description="Output Toggle bit for this pin" begin="12" end="12" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO109" description="Output Toggle bit for this pin" begin="13" end="13" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO110" description="Output Toggle bit for this pin" begin="14" end="14" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO111" description="Output Toggle bit for this pin" begin="15" end="15" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO112" description="Output Toggle bit for this pin" begin="16" end="16" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO113" description="Output Toggle bit for this pin" begin="17" end="17" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO114" description="Output Toggle bit for this pin" begin="18" end="18" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO115" description="Output Toggle bit for this pin" begin="19" end="19" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO116" description="Output Toggle bit for this pin" begin="20" end="20" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO117" description="Output Toggle bit for this pin" begin="21" end="21" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO118" description="Output Toggle bit for this pin" begin="22" end="22" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO119" description="Output Toggle bit for this pin" begin="23" end="23" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO120" description="Output Toggle bit for this pin" begin="24" end="24" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO121" description="Output Toggle bit for this pin" begin="25" end="25" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO122" description="Output Toggle bit for this pin" begin="26" end="26" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO123" description="Output Toggle bit for this pin" begin="27" end="27" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO124" description="Output Toggle bit for this pin" begin="28" end="28" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO125" description="Output Toggle bit for this pin" begin="29" end="29" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO126" description="Output Toggle bit for this pin" begin="30" end="30" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO127" description="Output Toggle bit for this pin" begin="31" end="31" width="1" rwaccess="R/W"/>
	</register>
	<register id="GPEDAT" width="32" page="1" offset="0x20" internal="0" description="GPIO E Data Register (GPIO128 to 159)">
		<bitfield id="GPIO128" description="Data Register for this pin" begin="0" end="0" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO129" description="Data Register for this pin" begin="1" end="1" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO130" description="Data Register for this pin" begin="2" end="2" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO131" description="Data Register for this pin" begin="3" end="3" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO132" description="Data Register for this pin" begin="4" end="4" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO133" description="Data Register for this pin" begin="5" end="5" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO134" description="Data Register for this pin" begin="6" end="6" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO135" description="Data Register for this pin" begin="7" end="7" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO136" description="Data Register for this pin" begin="8" end="8" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO137" description="Data Register for this pin" begin="9" end="9" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO138" description="Data Register for this pin" begin="10" end="10" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO139" description="Data Register for this pin" begin="11" end="11" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO140" description="Data Register for this pin" begin="12" end="12" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO141" description="Data Register for this pin" begin="13" end="13" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO142" description="Data Register for this pin" begin="14" end="14" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO143" description="Data Register for this pin" begin="15" end="15" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO144" description="Data Register for this pin" begin="16" end="16" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO145" description="Data Register for this pin" begin="17" end="17" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO146" description="Data Register for this pin" begin="18" end="18" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO147" description="Data Register for this pin" begin="19" end="19" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO148" description="Data Register for this pin" begin="20" end="20" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO149" description="Data Register for this pin" begin="21" end="21" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO150" description="Data Register for this pin" begin="22" end="22" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO151" description="Data Register for this pin" begin="23" end="23" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO152" description="Data Register for this pin" begin="24" end="24" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO153" description="Data Register for this pin" begin="25" end="25" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO154" description="Data Register for this pin" begin="26" end="26" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO155" description="Data Register for this pin" begin="27" end="27" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO156" description="Data Register for this pin" begin="28" end="28" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO157" description="Data Register for this pin" begin="29" end="29" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO158" description="Data Register for this pin" begin="30" end="30" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO159" description="Data Register for this pin" begin="31" end="31" width="1" rwaccess="R/W"/>
	</register>
	<register id="GPESET" width="32" page="1" offset="0x22" internal="0" description="GPIO E Data Set Register (GPIO128 to 159)">
		<bitfield id="GPIO128" description="Output Set bit for this pin" begin="0" end="0" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO129" description="Output Set bit for this pin" begin="1" end="1" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO130" description="Output Set bit for this pin" begin="2" end="2" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO131" description="Output Set bit for this pin" begin="3" end="3" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO132" description="Output Set bit for this pin" begin="4" end="4" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO133" description="Output Set bit for this pin" begin="5" end="5" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO134" description="Output Set bit for this pin" begin="6" end="6" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO135" description="Output Set bit for this pin" begin="7" end="7" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO136" description="Output Set bit for this pin" begin="8" end="8" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO137" description="Output Set bit for this pin" begin="9" end="9" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO138" description="Output Set bit for this pin" begin="10" end="10" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO139" description="Output Set bit for this pin" begin="11" end="11" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO140" description="Output Set bit for this pin" begin="12" end="12" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO141" description="Output Set bit for this pin" begin="13" end="13" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO142" description="Output Set bit for this pin" begin="14" end="14" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO143" description="Output Set bit for this pin" begin="15" end="15" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO144" description="Output Set bit for this pin" begin="16" end="16" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO145" description="Output Set bit for this pin" begin="17" end="17" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO146" description="Output Set bit for this pin" begin="18" end="18" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO147" description="Output Set bit for this pin" begin="19" end="19" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO148" description="Output Set bit for this pin" begin="20" end="20" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO149" description="Output Set bit for this pin" begin="21" end="21" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO150" description="Output Set bit for this pin" begin="22" end="22" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO151" description="Output Set bit for this pin" begin="23" end="23" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO152" description="Output Set bit for this pin" begin="24" end="24" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO153" description="Output Set bit for this pin" begin="25" end="25" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO154" description="Output Set bit for this pin" begin="26" end="26" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO155" description="Output Set bit for this pin" begin="27" end="27" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO156" description="Output Set bit for this pin" begin="28" end="28" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO157" description="Output Set bit for this pin" begin="29" end="29" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO158" description="Output Set bit for this pin" begin="30" end="30" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO159" description="Output Set bit for this pin" begin="31" end="31" width="1" rwaccess="R/W"/>
	</register>
