droneshire/ti/ccsv7/ccs_base/common/targetdb/Modules/C2000/f2837xd_gpio_data_regs.xml
	<register id="GPECLEAR" width="32" page="1" offset="0x24" internal="0" description="GPIO E Data Clear Register (GPIO128 to 159)">
		<bitfield id="GPIO128" description="Output Clear bit for this pin" begin="0" end="0" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO129" description="Output Clear bit for this pin" begin="1" end="1" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO130" description="Output Clear bit for this pin" begin="2" end="2" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO131" description="Output Clear bit for this pin" begin="3" end="3" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO132" description="Output Clear bit for this pin" begin="4" end="4" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO133" description="Output Clear bit for this pin" begin="5" end="5" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO134" description="Output Clear bit for this pin" begin="6" end="6" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO135" description="Output Clear bit for this pin" begin="7" end="7" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO136" description="Output Clear bit for this pin" begin="8" end="8" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO137" description="Output Clear bit for this pin" begin="9" end="9" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO138" description="Output Clear bit for this pin" begin="10" end="10" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO139" description="Output Clear bit for this pin" begin="11" end="11" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO140" description="Output Clear bit for this pin" begin="12" end="12" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO141" description="Output Clear bit for this pin" begin="13" end="13" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO142" description="Output Clear bit for this pin" begin="14" end="14" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO143" description="Output Clear bit for this pin" begin="15" end="15" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO144" description="Output Clear bit for this pin" begin="16" end="16" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO145" description="Output Clear bit for this pin" begin="17" end="17" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO146" description="Output Clear bit for this pin" begin="18" end="18" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO147" description="Output Clear bit for this pin" begin="19" end="19" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO148" description="Output Clear bit for this pin" begin="20" end="20" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO149" description="Output Clear bit for this pin" begin="21" end="21" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO150" description="Output Clear bit for this pin" begin="22" end="22" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO151" description="Output Clear bit for this pin" begin="23" end="23" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO152" description="Output Clear bit for this pin" begin="24" end="24" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO153" description="Output Clear bit for this pin" begin="25" end="25" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO154" description="Output Clear bit for this pin" begin="26" end="26" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO155" description="Output Clear bit for this pin" begin="27" end="27" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO156" description="Output Clear bit for this pin" begin="28" end="28" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO157" description="Output Clear bit for this pin" begin="29" end="29" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO158" description="Output Clear bit for this pin" begin="30" end="30" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO159" description="Output Clear bit for this pin" begin="31" end="31" width="1" rwaccess="R/W"/>
	</register>
	<register id="GPETOGGLE" width="32" page="1" offset="0x26" internal="0" description="GPIO E Data Toggle Register (GPIO128 to 159) ">
		<bitfield id="GPIO128" description="Output Toggle bit for this pin" begin="0" end="0" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO129" description="Output Toggle bit for this pin" begin="1" end="1" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO130" description="Output Toggle bit for this pin" begin="2" end="2" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO131" description="Output Toggle bit for this pin" begin="3" end="3" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO132" description="Output Toggle bit for this pin" begin="4" end="4" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO133" description="Output Toggle bit for this pin" begin="5" end="5" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO134" description="Output Toggle bit for this pin" begin="6" end="6" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO135" description="Output Toggle bit for this pin" begin="7" end="7" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO136" description="Output Toggle bit for this pin" begin="8" end="8" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO137" description="Output Toggle bit for this pin" begin="9" end="9" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO138" description="Output Toggle bit for this pin" begin="10" end="10" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO139" description="Output Toggle bit for this pin" begin="11" end="11" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO140" description="Output Toggle bit for this pin" begin="12" end="12" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO141" description="Output Toggle bit for this pin" begin="13" end="13" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO142" description="Output Toggle bit for this pin" begin="14" end="14" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO143" description="Output Toggle bit for this pin" begin="15" end="15" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO144" description="Output Toggle bit for this pin" begin="16" end="16" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO145" description="Output Toggle bit for this pin" begin="17" end="17" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO146" description="Output Toggle bit for this pin" begin="18" end="18" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO147" description="Output Toggle bit for this pin" begin="19" end="19" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO148" description="Output Toggle bit for this pin" begin="20" end="20" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO149" description="Output Toggle bit for this pin" begin="21" end="21" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO150" description="Output Toggle bit for this pin" begin="22" end="22" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO151" description="Output Toggle bit for this pin" begin="23" end="23" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO152" description="Output Toggle bit for this pin" begin="24" end="24" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO153" description="Output Toggle bit for this pin" begin="25" end="25" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO154" description="Output Toggle bit for this pin" begin="26" end="26" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO155" description="Output Toggle bit for this pin" begin="27" end="27" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO156" description="Output Toggle bit for this pin" begin="28" end="28" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO157" description="Output Toggle bit for this pin" begin="29" end="29" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO158" description="Output Toggle bit for this pin" begin="30" end="30" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO159" description="Output Toggle bit for this pin" begin="31" end="31" width="1" rwaccess="R/W"/>
	</register>
	<register id="GPFDAT" width="32" page="1" offset="0x28" internal="0" description="GPIO F Data Register (GPIO160 to 168)">
		<bitfield id="GPIO160" description="Data Register for this pin" begin="0" end="0" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO161" description="Data Register for this pin" begin="1" end="1" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO162" description="Data Register for this pin" begin="2" end="2" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO163" description="Data Register for this pin" begin="3" end="3" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO164" description="Data Register for this pin" begin="4" end="4" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO165" description="Data Register for this pin" begin="5" end="5" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO166" description="Data Register for this pin" begin="6" end="6" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO167" description="Data Register for this pin" begin="7" end="7" width="1" rwaccess="R/W"/>
		<bitfield id="GPIO168" description="Data Register for this pin" begin="8" end="8" width="1" rwaccess="R/W"/>
	</register>
